#include <iostream>
#include <cmath>
using namespace std;

int main()
{
    setlocale(LC_ALL, "ru");

    /*
    Напишите программу (на Pthn, C++ и на алгоритмическом языке),
    которая запрашивает два числа и выводит максимальное из них

    int a;
    int b;

    cout << "Введите первое число: ";
    cin >> a;
    cout << "Введите второе число: ";
    cin >> b;

    if (a > b) {
        cout << a << "больше" << b;
    }
    else if (b > a) {
        cout << b << "больше" << a;
    }
    else if (a = b) {
        cout << "Числа равные";
    }
    else {
        cout << "Неккоректный ввод";
    }
    */

    /*
    Напишите программу (на Pthn, C++ и на алгоритмическом языке),
    которая решает квадратное уравнение 𝑎𝑥2 + 𝑏𝑥 + 𝑐 = 0

    int a, b, c;
    cout << "Введите значение a: ";
    cin >> a;
    cout << "Введите значение b: ";
    cin >> b;
    cout << "Введите значение c: ";
    cin >> c;

    int d = pow(b, 2) - 4 * a * c;

    if (d > 0) {
        float x_1 = (-b + sqrt(d)) / (2 * a);
        float x_2 = (-b - sqrt(d)) / (2 * a);
        cout << "x_1 = " << x_1;
        cout << "x_2 = " << x_2;
    }
    else if (d == 0) {
        float x = (-b) / (2 * a);
        cout << "x = " << x;
    }
    else if (d < 0) {
        cout << "Нету решения";
    }
    */

    /*
    Напишите программу (на Pthn, C++ и на алгоритмическом языке),
    которая определяет, является ли год високосным (год високосный, если он
    кратен 4, но не кратен 100, или кратен 400).

    int year;
    cout << "Введите год: ";
    cin >> year;

    if (year % 4 == 0 and (year % 100 != 0 || year % 400 == 0)) {
        cout << "Високосный";
    }
    else {
        cout << "Невисокосный";
    }
    */

    /*
    Напишите программу (на Pthn, C++ и на алгоритмическом языке),
    которая по номеру месяца (1-12) выводит название месяца и количество дней
    в нем.

    int n;
    cout << "Введите номер месяца: ";
    cin >> n;

    if (n == 1) {
        cout << "Год: Январь, Кол-во дней: 31";
    }
    else if (n == 2) {
        cout << "Год: Февраль, Кол-во дней: 28";
    }
    else if (n == 3) {
        cout << "Год: Март, Кол-во дней: 31";
    }
    else if (n == 4) {
        cout << "Год: Апрель, Кол-во дней: 30";
    }
    else if (n == 5) {
        cout << "Год: Май, Кол-во дней: 31";
    }
    else if (n == 6) {
        cout << "Год: Июнь, Кол-во дней: 30";
    }
    else if (n == 7) {
        cout << "Год: Июль, Кол-во дней: 31";
    }
    else if (n == 8) {
        cout << "Год: Август, Кол-во дней: 31";
    }
    else if (n == 9) {
        cout << "Год: Сентябрь, Кол-во дней: 30";
    }
    else if (n == 10) {
        cout << "Год: Октябрь, Кол-во дней: 31";
    }
    else if (n == 11) {
        cout << "Год: Ноябрь, Кол-во дней: 30";
    }
    else if (n == 12) {
        cout << "Год: Декабрь, Кол-во дней: 31";
    }
    else {
        cout << "Неккоректный ввод";
    }
    */

    /*
    Напишите программу-калькулятор (на Pthn, C++ и на
    алгоритмическом языке), которая запрашивает два числа и символ операции
    (+, -, *, /), а затем выводит результат.


    int x, y, a;

    cout << "Введите первое число: ";
    cin >> x;
    cout << "Введите второе число: ";
    cin >> y;
    cout << "Выберите действие: 1.+   2.-   3.*   4./:";
    cin >> a;

    if (a == 1) {
        cout << x << " + " << y << " = " << x + y;
    }
    else if (a == 2) {
        cout << x << " - " << y << " = " << x - y;
    }
    else if (a == 3) {
        cout << x << " * " << y << " = " << x * y;
    }
    else if (a == 4) {
        cout << x << " / " << y << " = " << x / y;
    }
    else {
        cout << "Неккоректный ввод";
    }
    */

    /*
    Напишите программу на Pthn и C++. Запросите сумму покупки. Если
    сумма > 500 – скидка 20%, если > 1000 – скидка 10%, иначе скидки нет.
    Выведите итоговую стоимость

    int sum;
    cout << "Введите стоимость: ";
    cin >> sum;

    if (sum > 1000) {
        cout << "Итоговая стоимость: " << sum + (sum * 0.9);
    }
    else if (sum > 500) {
        cout << "Итоговая стоимость: " << sum + (sum * 0.8);
    }
    else {
        cout << "Итоговая стоимость: " << sum;
    }
    */

    /*
    Напишите программу на Pthn и C++. Запросите координаты точки (),
    ). Определите, в какой четверти она находится (или на оси).

    int x, y;
    cout << "Введите x: ";
    cin >> x;
    cout << "Введите y: ";
    cin >> y;

    if (x > 0 and y > 0) {
        cout << "1 четверть";
    }
    else if (x < 0 and y > 0) {
        cout << "2 четверть";
    }
    else if (x < 0 and y < 0) {
        cout << "3 четверть";
    }
    else if (x > 0 and y < 0) {
        cout << "4 четверть";
    }
    else {
        cout << "Неккоректный ввод"
    }
    */

    /*
    Напишите программу на Pthn и C++. Запросите сумму вклада и срок
    (в месяцах). Определите ставку:
    · До 6 месяцев - 5%;
    · 6-12 месяцев - 7%;
    · Более 12 месяцев - 10%.
    Выведите итоговую сумму.
  
    int sum, times;
    cout << "Введите сумму вклада: ";
    cin >> sum;
    cout << "Введите срок в месяцах: ";
    cin >> times;

    if (times < 6) {
        cout << "Итоговая сумма: " << sum + (sum * 0.05);
    }
    else if (times >= 6 and times < 12) {
        cout << "Итоговая сумма: " << sum + (sum * 0.07);
    }
    else if (times >= 12) {
        cout << "Итоговая сумма: " << sum + (sum * 0.1);
    }
    else {
        cout << "Неккоректный ввод";
    }
    */
}